trunk/cmcc-hlj-saml-project/cmcc-hlj-saml-client/src/main/resources/template/samlp.ActivateRequest.template.xml

<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <samlp:ActivateRequest
        xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol"
        xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion"
        ID="${samlId}"
        IssueInstant="${issueInstant}"
        Version="2.0">
        <saml:Issuer>${samlIssuer}</saml:Issuer>
        <saml:NameID Format="urn:oasis:names:tc:SAML:2.0:nameidformat:transient">${nameId}</saml:NameID>
    </samlp:ActivateRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

